//Цикл for
// console.log('Наш баланс 1$');
// console.log('Наш баланс 2$');
// console.log('Наш баланс 3$');
// console.log('Наш баланс 4$');
// console.log('Наш баланс 5$');
// console.log('Наш баланс 6$');
// console.log('Наш баланс 7$');
// console.log('Наш баланс 8$');
// console.log('Наш баланс 9$');
/* 1 часть  обьявление той или иной переменной которая принимает участие(и с которой в се начинается), 2 часть проверка условия когда наш цикл должен быть завершен, и 3 часть это действие с нашей переменной.  */

for(let i = 1; i <= 10; i = i + 2 /* можно и написать i++*/){
 console.log(`Наш баланс ${i}`);
}

