//Циклы в циклах
// for(let i=1; i < 10; i++){
//     console.log(`Цикл 1 - ${i}`);  //Будет идти Цикл 1 - 1 и т.д
//     for(let j = 1; j < 5; j++){
//         console.log(`Цикл 2 - ${j}`);//Этот внутренний цикл будет исполняться в n раз часе чем внешний цикл, потому что он  исполняется при каждой итерации внешнего цикла.
//     }
// }

const tasks = [[1, 'Задача 1'], [2, 'Задача 2']]


for(let i= 0; i < tasks.length; i++){
    for(let j = 0; j < tasks[i].length; j++){
        console.log(tasks[i][j]);
    }
}



//Это было бы как 
// const a = tasks[i];
// const b = a[j]

//Тут  будет  
// 1
// app.js:14 Задача 1
// app.js:14 2
// app.js:14 Задача 2




// Цикл 1 - 1
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4
// app.js:3 Цикл 1 - 2
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4
// app.js:3 Цикл 1 - 3
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4
// app.js:3 Цикл 1 - 4
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4
// app.js:3 Цикл 1 - 5
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4
// app.js:3 Цикл 1 - 6
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4
// app.js:3 Цикл 1 - 7
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4
// app.js:3 Цикл 1 - 8
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4
// app.js:3 Цикл 1 - 9
// app.js:5 Цикл 2 - 1
// app.js:5 Цикл 2 - 2
// app.js:5 Цикл 2 - 3
// app.js:5 Цикл 2 - 4 