//Процесс исполнения JS 
//Исполнением js является какой либо движок и их несколько
//eng 8 это хромиум ну и он работает на node.js
//spider monkey он работает в firefox
//jsCore на macOs.

//Что внутри js 

//Call Stack - Контекст исполнения(последовательность вызова и т.д)
//Heap - Обьекты в памяти(большое хранение в памяти, осыобождение памяти и т.д) еще называется: "Куча"

//Итерация vs Компиляция 


//Компиляция: Исходный код => Файл машинного кода => Исполнение
//Итерпритация:  Исходный код => Исполнение  (то есть прочитали исполнили)
//JIT: Исходный код => Машинный код => Исполнение


//AST -- абстрактное синтакситеское дерево это преставление кода которое удобно для машины.
//Также парсер сохдает этот же AST. Чтобы дальше идти в  интерпритатор потом в байт код и т.д

//Среда исполнения JS 

//Web APIs / Node
// Dom, Times, Fetch, GEO


//CallBack Queue(ОЧередь callBacks)
//Пусто.

//Движок JS
//Call Stack и Heap
